---
kind: method
id: M:Autodesk.Revit.DB.CurtainGridLine.AddAllSegments
source: html/5c4a3c78-b527-31c8-aeb8-b9d51c2b56e4.htm
---
# Autodesk.Revit.DB.CurtainGridLine.AddAllSegments Method

All the segments on this grid line will be added.

## Syntax (C#)
```csharp
public void AddAllSegments()
```